hackathon-teamup-backend/app/controllers/collaborators_controller.rb

SELECT "collaborators".* FROM "collaborators"
---
  def index
    @collaborators = Collaborator.all

INSERT INTO "collaborators" ("name", "role", "skills", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Gina"], ["role", "2D Artist"], ["skills", "color schemes, character design, patterns"], ["created_at", "2020-05-25 07:52:10.269537"], ["updated_at", "2020-05-25 07:52:10.269537"]]
---
  def create
    @collaborator = Collaborator.new(collaborator_params)

    if @collaborator.save

DELETE FROM "collaborators" WHERE "collaborators"."id" = ?  [["id", 9]]
---
  def destroy
    @collaborator.destroy

SELECT "collaborators".* FROM "collaborators" WHERE "collaborators"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_collaborator
      @collaborator = Collaborator.find(params[:id])