hackathon-teamup-backend/app/controllers/team_members_controller.rb

  def create
    @team_member = TeamMembers.new(team_member_params)

    if @team_member.save
---
INSERT INTO "team_members" ("team_id", "collaborator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["team_id", 2], ["collaborator_id", 7], ["created_at", "2020-05-25 16:11:39.272712"], ["updated_at", "2020-05-25 16:11:39.272712"]]