hackathon-teamup-backend/app/controllers/teams_controller.rb

  def create
    @team = Team.new(team_params)

    if @team.save
---
INSERT INTO "teams" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Puppy McPuppy"], ["description", "homework assignment for bootcamp"], ["created_at", "2020-05-25 08:33:45.123663"], ["updated_at", "2020-05-25 08:33:45.123663"]]

  def destroy
    @team.destroy
---
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 3]]